const getMonthLength = (date) => {
  return parseInt((new Date().getTime() - new Date(date).getTime())/(1000 * 60 * 60 * 24 * 30)) + 1
}

export default [
  {
    type: 2,
    industry: "高级研发工程师",
    time: `20201203-至今(${getMonthLength('2020/12/03')}个月)`,
    work: [
      "负责快的新出租小程序的维护以及日常功能交付及性能优化",
      "扫码付、红包码、年度司机评选等营销活动",
      "营销组件：后台管理 --> C端组件(npm 发包) --> H5 / 小程序0成本使用",
      "负责滴滴出行小程序，行中模块，日常业务迭代",
      "推动项目进度，把控研发风险"
    ],
  },
  {
    type: 1,
    industry: "高级软件开发工程师",
    time: "201807-202012",
    work: [
      "日常系统（多级公文、内控系统、工作流系统）技术选型、开发",
      "调研并开发团队使用脚手架,统一开发规范",
      "设计UED规范、产出对应的组件库",
      "表单设计器开发、工作流(bpmn.js)引擎迭代",
    ],
  },
];
