export default [
  {
    name: '行中模块',
    time: '202301-至今',
    role: 'RD',
    duty: [
      '日常行程中模块迭代',
      '弹窗、司机卡片等业务组件维护'
    ],
    result: [
      '开发中，数据统计中'
    ],
    type: 2,
  },
  {
    name: "红包码（营销）",
    time: "202206-202211",
    role: "项目owner",
    duty: [
      "复用扫码付营销后台，营销组件、订阅消息组件",
      "添加司推乘、司推套能力",
      "联合跳转扫码付能力",
    ],
    result: [
      '开城使用占比平均在10%以上',
      '整合营销工具和支付工具，提升司乘双方心智',
    ],
    type: 2,
  },
  {
    name: "腾讯出行出租车打车业务（异业合作）",
    time: "202206-202210",
    role: "项目owner",
    duty: [
      "打车流程拆解，有分包转为独立分包的开发模式",
      "账号体系隔离，用户信息保护",
      "推动地图sdk能力定制",
    ],
    result: [
      '提供每天十万级别的引流',
      '统一异业合作模板，可快速接入潜在的外部渠道合作',
    ],
    type: 2,
  },
  {
    name: "扫码付（支付工具）",
    time: "202106-202204",
    role: "项目owner",
    duty: [
      "技术选型变化：h5-->小程序",
      "加载速度：主包体积优化、分包异步化处理、分包预加载处理，添加logo，降低主包体积",
      "登录链路优化：强制登录-->可放弃登录、openid-->unionid",
      "营销组件：本单立减组件、天降红包、自定义键盘",
      "数据采集：数据收集sdk，可视化管理页面"
    ],
    result: [
      // '新召用户14日转化：0-->11%，线上完单4W/天',
      '新召用户14日转化：提升明显',
      // '体积减少40%、扫码付速度在中型设备上耗时减少30%',
      '体积和耗时提升明显',
      // '扫码付日订单11W-->120W',
      '扫码付日订单量级变化',
      '沉淀出租车营销后台、对应的小程序组件'
    ],
    type: 2,
  },
  {
    name: "快的新出租独立小程序",
    time: "202012-202106",
    role: "项目owner",
    duty: [
      "使用mpx（类vue语法）开发，兼容支付宝、微信等小程序",
      "开发首页、冒泡、行程中等主流程供异业合作使用",
      "风险管理、功能交付",
      "体积优化",
      "裂变增长（乘推乘）、外部合作",
    ],
    result: [
      // '小程序日均完单1.1w-->峰值4W单',
      '小程序日均完单倍数增长',
    ],
    type: 2,
  },
  {
    name: "前端规划",
    time: "202002-202012",
    role: "前端负责人",
    duty: [
      "前端H5转发代理服务器维护",
      "开发脚手架，统一标准，支持初始化自定义，远程模板拉取等",
      "设置UED规范完成前端设计规范网站",
    ],
    result: [
      '支持用户总数150W，pv50W业务日常稳定',
      '支持团队开发基本需求',
      '统一技术栈和设计规范、降低开发成本'
    ],
    type: 1,
  },
  {
    name: "工作流相关项目",
    time: "201811-201911",
    role: "项目owner",
    duty: [
      "vue2+vue-cli3(cli4)+vant(element)项目构建和研发",
      "多级公文流转、内控系统、工作流系统等的移动端和web端项目技术选型和开发",
      "项目推动，兄弟团队合作沟通、保证项目稳定按时交付",
    ],
    result: [
      '支持项目按时交付，支持本地化部署和开城配置',
      '支持金华市公文流转相关内部系统的稳定性和灵活性',
      '支持相关教育行业内部系统快速线上化'
    ],
    type: 1,
  },
  {
    name: "工作流引擎和表单设计器维护",
    time: "20180705-201811",
    role: "维护者",
    duty: [
      "基于开源项目bpmn-js经行修改的工作引擎，github地址：https://github.com/bpmn-io/bpmn-js",
      "流程设计器ui上面主要使用的jq",
      "使用preact（react的一个子类）书写的表单设计器插件，高度自定义，",
    ],
    result: [
      '支持公司工作流类业务稳定性',
      '支持表单的定制化，兼容多个业务的业务需求'
    ],
    type: 1,
  },
];
