export default [
  {
    name: "快的新出租小程序",
    time: "202012-至今",
    role: "项目owner",
    duty: [
      "使用mpx（类vue语法）开发，兼容支付宝、微信等小程序",
      "风险管理、功能交付",
      "体积优化、组件建设",
      "裂变增长（乘推乘）、扬招渗透、外部合作",
    ],
    result: [
      '建设taxi-ui、体积减少40%、扫码付速度在中型设备上耗时减少30%',
      '小程序日均完单1.1w-->3W单',
      '扫码付订单11W-->90W',
    ],
    type: 2,
  },
  {
    name: "前端规划",
    time: "202002-202012",
    role: "前端负责人",
    duty: [
      "前端H5转发代理服务器维护",
      "开发脚手架，统一标准，支持初始化自定义，远程模板拉取等",
      "设置UED规范完成前端设计规范网站",
    ],
    result: [
      '支持用户总数150W，pv50W业务日常稳定',
      '支持团队开发基本需求',
      '统一技术栈和设计规范、降低开发成本'
    ],
    type: 1,
  },
  {
    name: "工作流相关项目",
    time: "201811-201911",
    role: "项目owner",
    duty: [
      "vue2+vue-cli3(cli4)+vant(element)项目构建和研发",
      "多级公文流转、内控系统、工作流系统等的移动端和web端项目技术选型和开发",
      "项目推动，兄弟团队合作沟通、保证项目稳定按时交付",
    ],
    result: [
      '支持项目按时交付，支持本地化部署和开城配置',
      '支持金华市公文流转相关内部系统的稳定性和灵活性',
      '支持相关教育行业内部系统快速线上化'
    ],
    type: 1,
  },
  {
    name: "工作流引擎和表单设计器维护",
    time: "20180705-201811",
    role: "维护者",
    duty: [
      "基于开源项目bpmn-js经行修改的工作引擎，github地址：https://github.com/bpmn-io/bpmn-js",
      "流程设计器ui上面主要使用的jq",
      "使用preact（react的一个子类）书写的表单设计器插件，高度自定义，",
    ],
    result: [
      '支持公司工作流类业务稳定性',
      '支持表单的定制化，兼容多个业务的业务需求'
    ],
    type: 1,
  },
];
