export default [
	'熟练掌握HTML5、CSS3、Javascript、ES6/ES next开发;熟练使用scss、less,为熟悉和熟练vue/react框架提供夯实基础',
	'使用第三方组件库,element-ui、vant、echarts等完成基础业务并高还原度完成页面,完成复杂应用的孵化和稳定迭代',
	'通过vue+vite+WindiCSS,快速孵化营销后台管理,收敛ToC业务组件;并将出租车营销活动快速落地到营销平台,实现研发0/低投入扩展营销场景',
	'使用preact库(类react)开发表单设计器、H5营销组件,提供umd方式引入,实现使用不挑框架,不限制DSL',
	'使用mpx(小程序开发框架),0->1孵化出租车小程序,并找到扫码付、红包码等抓手快速让UV达到百万级;同时了解和比较开发小程序的其他解决方案(taro、mpvu、uni-app、wepy2)',
	'开发滴滴小程序行中模块,梳理弹窗、小助手、司机卡片等业务组件,为业务提供统一管理,统一配置能力,支持优惠感知等高确定性感知用户',
	'使用nodeJS收敛开发框架vue、react、mpx、preact来支持不同端不同业务场景的开发,并落地到开发人员中,为公司统一开发规范,并产出相应的UED规范'
];
